-- Adminer 4.2.1 MySQL dump

SET NAMES utf8;
SET time_zone = '+00:00';
SET foreign_key_checks = 0;
SET sql_mode = 'NO_AUTO_VALUE_ON_ZERO';

DROP TABLE IF EXISTS `ads`;
CREATE TABLE `ads` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `seller_name` varchar(50) NOT NULL,
  `allow_mails` tinyint(4) NOT NULL,
  `phone` varchar(12) NOT NULL,
  `title` varchar(100) NOT NULL,
  `description` text NOT NULL,
  `price` decimal(10,0) unsigned NOT NULL,
  `location_id` int(10) unsigned NOT NULL,
  `category_id` int(10) unsigned NOT NULL,
  `organization_form_id` int(10) unsigned NOT NULL,
  `email` varchar(100) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;


DROP TABLE IF EXISTS `categories`;
CREATE TABLE `categories` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) CHARACTER SET utf16 NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

INSERT INTO `categories` (`id`, `name`) VALUES
(1,	'--- Выберите категорию---'),
(2,	'Автомобили с пробегом'),
(3,	'Новые автомобили'),
(4,	'Мотоциклы и мототехника'),
(5,	'Грузовики и спецтехника'),
(6,	'Водный транспорт'),
(7,	'Запчасти и аксессуары'),
(8,	'Квартиры'),
(9,	'Комнаты'),
(10,	'Дома, дачи, коттеджи'),
(11,	'Земельные участки'),
(12,	'Гаражи и машиноместа'),
(13,	'Коммерческая недвижимость'),
(14,	'Недвижимость за рубежом'),
(15,	'Вакансии (поиск сотрудников)'),
(16,	'Резюме (поиск работы)Услуги'),
(17,	'Предложения услуг'),
(18,	'Запросы на услуги'),
(19,	'Личные вещи'),
(20,	'Одежда, обувь, аксессуары'),
(21,	'Детская одежда и обувь'),
(22,	'Товары для детей и игрушки'),
(23,	'Часы и украшения'),
(24,	'Красота и здоровье'),
(25,	'Для дома и дачи'),
(26,	'Бытовая техника'),
(27,	'Мебель и интерьер'),
(28,	'Посуда и товары для кухни'),
(29,	'Продукты питания'),
(30,	'Ремонт и строительство'),
(31,	'Растения'),
(32,	'Бытовая электроника'),
(33,	'Аудио и видео'),
(34,	'Игры, приставки и программы'),
(35,	'Настольные компьютеры'),
(36,	'Ноутбуки'),
(37,	'Оргтехника и расходники'),
(38,	'Планшеты и электронные книги'),
(39,	'Телефоны'),
(40,	'Товары для компьютера'),
(41,	'Фототехника'),
(42,	'Хобби и отдых'),
(43,	'Билеты и путешествия'),
(44,	'Велосипеды'),
(45,	'Книги и журналы'),
(46,	'Коллекционирование'),
(47,	'Музыкальные инструменты'),
(48,	'Охота и рыбалка'),
(49,	'Спорт и отдых'),
(50,	'Знакомства'),
(51,	'Животные'),
(52,	'Собаки'),
(53,	'Кошки'),
(54,	'Птицы'),
(55,	'Аквариум'),
(56,	'Другие животные'),
(57,	'Товары для животных'),
(58,	'Для бизнеса'),
(59,	'Готовый бизнес'),
(60,	'Оборудование для бизнеса');

DROP TABLE IF EXISTS `cities`;
CREATE TABLE `cities` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(30) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

INSERT INTO `cities` (`id`, `name`) VALUES
(1,	'---Выберите город---'),
(2,	'Новосибирск'),
(3,	'Барабинск'),
(4,	'Бердск'),
(5,	'Искитим'),
(6,	'Колывань'),
(7,	'Краснообск'),
(8,	'Куйбышев'),
(9,	'Мошково'),
(10,	'Обь'),
(11,	'Ордынское'),
(12,	'Черепаново');

-- 2015-06-08 04:13:05
